MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
/*
 * app.c
 *
 *  Created on: Apr 29, 2024
 *      Author: Jan Mareš
 */


#include "main.h"
#include "app.h"
#include "max7219.h"
#include "usbpd_def.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_user.h"
#include "usbpd_user_services.h"
#include "string.h"
#include "stdio.h"
#include "stdbool.h"
#include <stm32g0xx_ll_adc.h>

#include "usb_device.h"
#include "usbd_cdc_if.h"
#include <usbpd_trace.h>


int32_t BSP_USBPD_PWR_VBUSGetCurrentOCP(uint32_t Instance, int32_t *pCurrentOCP);
int32_t BSP_PWR_VBUSGetCurrentOCP(uint32_t PortId);

//Variables declaration
int encoderVal; //TIM2 CNT register reading
int encoderValPrev;
int dac_value = 500;

int ocp_reset_needed = 0;

uint32_t srcPdoIndex; //variable that holds Pdo index from FindVoltageIndex
USBPD_DPM_SNKPowerRequestDetailsTypeDef powerRequestDetails;
USBPD_StatusTypeDef powerProfiles;

__IO uint16_t aADCxConvertedValues[ADC_NUM_OF_SAMPLES] = {0};

typedef enum {
	ADJUSTMENT_CURRENT = 0x0u,      /*!< Current adjustment state */
	ADJUSTMENT_VOLTAGE = 0x1u,      /*!< Voltage adjustment state */
	ADJUSTMENT_CURRENT_OCP = 0x2u   /*!< CurrentOCP adjustment state */
} AdjustmentState;

typedef enum {
	OUTPUT_OFF_STATE = 0x0u,      /*!< Current adjustment state */
	OUTPUT_ON_STATE = 0x1u,      /*!< Voltage adjustment state */

} OutputState;


//USB communication
uint8_t *data = "Hello World from USB CDC\n";
uint8_t usb_buffer[64];

// Define a typedef for the state variable
typedef AdjustmentState Adjustment_StateTypedef;
typedef OutputState Output_StateTypedef;

// Declare a variable to hold the current state
volatile Adjustment_StateTypedef currentState = ADJUSTMENT_VOLTAGE;
volatile Output_StateTypedef outputState = OUTPUT_OFF_STATE;

/*Add variables for LUPART2*/
#define RX_BUFFER_SIZE 64
static uint8_t rxBuffer[RX_BUFFER_SIZE];
static uint32_t rxIndex = 0;
uint32_t counter = 0;

//Initialize button event struct
SystemEvents systemEvents = {0};
//Init stateMachine struct
StateMachine stateMachine = {
		.currentState = STATE_INIT,
		.encoder = {
				.selDigit = 2,
				.increment = 10    // Default increment
			}
};

SINKData_HandleTypeDef SNK_data = {
	.voltageMin = 500,
	.voltageSet = 600, //initial value to display
	.currentSet = 1000, //initial value to display
	.currentMin = 0,
	.currentOCPSet = 1000,
	.selMethod = PDO_SEL_METHOD_MAX_CUR,
	.encoder = {
		.selDigit = 2,
		.increment = 10    // Default increment
	}
};

// Define the pointer to the struct
SINKData_HandleTypeDef *dhandle = &SNK_data;
StateMachine *sm = &stateMachine;
SystemEvents *events = &systemEvents;


void runStateMachine(void) {
	// Process events and transitions
	switch (sm->currentState) {
		case STATE_OFF:
			//handleOffState(sm, dhandle);
			break;
		case STATE_INIT:
			handleInitState();
			break;
		case STATE_IDLE:
			handleIdleState();
			break;
		case STATE_ACTIVE:
			handleActiveState();
			break;
		case STATE_LOCK:
			//handleLockState(sm, dhandle);
			break;
		case STATE_ERROR:
			//handleErrorState(sm, dhandle);
			break;
		case STATE_OCP_TOGGLE:
			//handleOCPToggleState(sm, dhandle);
			break;
		case STATE_SET_VALUES:
			handleSetValuesState();
			break;
		default:
			// Error handling
			sm->currentState = STATE_ERROR;
			//sm->errorCode = ERROR_INVALID_STATE;
			break;
	}

}

// Callback when ADC conversion is complete
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
  HAL_GPIO_TogglePin(LED_USER_GPIO_Port, LED_USER_Pin);
}

// Callback when ADWG2 (CH7 ISENSE) goes out of range
void HAL_ADCEx_LevelOutOfWindow2Callback(ADC_HandleTypeDef *hadc) {
	systemEvents.awdgEvent = true;
	//Disable output
	HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);
}

/**
 * Update ADC CH3 AWD Treshold
 * Possibility to update parameters on the fly (read more in HAL_ADC_AnalogWDGConfig declaration)
 * Full config and AWD init in main.c
 */
void Update_AWD_Thresholds(uint32_t low, uint32_t high) {
	// Just update the thresholds for an already configured AWD
	ADC_AnalogWDGConfTypeDef AnalogWDGConfig = {0};
	AnalogWDGConfig.WatchdogNumber = ADC_ANALOGWATCHDOG_2; // Specify which AWD you're updating
	AnalogWDGConfig.HighThreshold = high;
	AnalogWDGConfig.LowThreshold = low;

	if (HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) != HAL_OK)
	{
	    Error_Handler();
	}
}
/*
 * Initialization function
 */
void app_init(void){

	//TIM7 initialization
	LL_TIM_EnableIT_UPDATE(TIM7); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	LL_TIM_ClearFlag_UPDATE(TIM7); //Clear update flag on TIMER7

	//TIM14 initialization
	LL_TIM_DisableIT_UPDATE(TIM14); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	LL_TIM_ClearFlag_UPDATE(TIM14); //Clear update flag on TIMER14

	//TIM14 initialization
	LL_TIM_DisableIT_UPDATE(TIM15); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	LL_TIM_ClearFlag_UPDATE(TIM15); //Clear update flag on TIMER14

	//TIM3 initialization of encoder
	HAL_TIM_Encoder_Start_IT(&htim3, TIM_CHANNEL_ALL);
	__HAL_TIM_SET_COUNTER(&htim3, 30000); //write non 0 value to avoid shift from 0 -> max value
	encoderVal = __HAL_TIM_GET_COUNTER(&htim3)/4;
	//encoderValPrev = encoderVal;

	/*
	//Set tim IT freq to 10Khz (TIM4 runs on PCLK 64MHz)
	TIM4->PSC = 64-1;
	TIM4->ARR = 100-1;

	// Enable update interrupt
	LL_TIM_EnableIT_UPDATE(TIM4);
	LL_TIM_ClearFlag_UPDATE(TIM4);
	LL_TIM_SetCounter(TIM4, 0);
	LL_TIM_EnableCounter(TIM4);*/


	//Init DAC
	HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Wait for hardware initialization and then turn DB to HIGH (according to TCPP01-M12 datasheet 6.5)
	HAL_Delay(200);
	HAL_GPIO_WritePin(DB_OUT_GPIO_Port, DB_OUT_Pin, GPIO_PIN_SET);

	//Calibrate and start ADC sensing with DMA
	HAL_ADCEx_Calibration_Start(&hadc1);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&aADCxConvertedValues, ADC_NUM_OF_SAMPLES);

	//TIM4 initialization
	HAL_TIM_Base_Start(&htim4);

	//Init 7 segment display
	max7219_Init( 7 );
	max7219_Decode_On();

	//Print decimal points and initial values
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
	max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);

	//HAL_GPIO_WritePin(OCP_RESET_GPIO_Port, OCP_RESET_Pin, GPIO_PIN_SET);
}


