MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
/*
 * Loop function
 */
void app_loop(void) {
	//CDC_Transmit_FS(data, strlen(data));*/
	// Process button events
	processSystemEvents();

	// Run the state machine
	//runStateMachine(&stateMachine, &SNK_data);
	runStateMachine();

	// Reset button states after processing
	stateMachine.outputBtnPressed = false;
	stateMachine.lockBtnPressed = false;
	stateMachine.voltageCurrentBtnPressed = false;
	stateMachine.rotaryBtnPressed = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.stateTimeoutFlag = false;
	stateMachine.periodicCheckFlag = false;
	stateMachine.encoderTurnedFlag = false;
}

/*
 * Define Callbacks and ISR
 */
//BTN ISR to set event flags
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
        systemEvents.voltageCurrentBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM2);
    } else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {
        systemEvents.lockBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM4);
        //lockButtonPressTime = HAL_GetTick();
    } else if (GPIO_Pin == SW3_OFF_ON_Pin) {
        systemEvents.outputBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM1);
    } else if (GPIO_Pin == ENC_TOGGLE_UNITS_Pin) {
        systemEvents.rotaryBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM8);
    }

    // Start debounce timer
    TIM7->ARR = 200;
    LL_TIM_SetCounter(TIM7, 0);
    LL_TIM_EnableCounter(TIM7);
}

//TIM capture callback
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
    	systemEvents.encoderTurnEvent = true;
    }
}

void TIM14_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM14)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM14);

		// Handle periodic check for ACTIVE state
		systemEvents.periodicCheckEvent = true;
		//Reset CNT value
		LL_TIM_SetCounter(TIM14, 0);

		//Start timer again
		LL_TIM_EnableCounter(TIM14);
	}
}


void TIM15_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM15)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM15);

		// Handle periodic check for ACTIVE state
		systemEvents.stateTimeoutEvent = true;
		//Reset CNT value
		//LL_TIM_DisableCounter(TIM15);  // Stop the timer after timeout

	}
}

/*
 * Define Process functions
 */
// Process button events in the main loop (Convert hardware events into logical events)
void processButtonEvents(void) {
    if (events->outputBtnEvent) {
    	//Reset btn event flag
        events->outputBtnEvent = false;
        sm->outputBtnPressed = true;
    } else if (events->voltageCurrentBtnEvent) {
    	events->voltageCurrentBtnEvent = false;
    	sm->voltageCurrentBtnPressed = true;
    } else if (events->lockBtnEvent) {
    	events->lockBtnEvent = false;
		sm->lockBtnPressed = true;

		//Toggle OCP mode
		switch(sm->OCPMode) {
			case OCP_DISABLED:
				// Enable the specific AWDG interrupt
				__HAL_ADC_ENABLE_IT(&hadc1, ADC_IT_AWD2);
				sm->OCPMode = OCP_ENABLED;
				break;
			case OCP_ENABLED:
				// Enable the specific AWDG interrupt
				__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD2);
				sm->OCPMode = OCP_DISABLED;
				break;
		}
    } else if (events->rotaryBtnEvent) {
    	//Reset btn event flag
    	events->rotaryBtnEvent = false;
		sm->rotaryBtnPressed = true;

    }
}

// Main system event processor that calls specialized handlers
void processSystemEvents(void) {
    // Process different event types using specialized functions
    processButtonEvents();

    if (events->encoderTurnEvent) {
    	sm->encoderTurnedFlag = true;
    	events->encoderTurnEvent = false;
    }
    if (events->stateTimeoutEvent) {
		sm->stateTimeoutFlag= true;
		events->stateTimeoutEvent = false;
	}
	if (events->periodicCheckEvent) {
		sm->periodicCheckFlag= true;
		events->periodicCheckEvent = false;
	}
    // Process AWDG events
    if (events->awdgEvent) {
        events->awdgEvent = false;
        sm->awdgTriggeredFlag = true;
    }
}


/*
 * Define state Handle functions
 */
void handleInitState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
    	// Set the state entry time and timeout duration
		sm->stateEntryTime = HAL_GetTick();
		sm->timeoutCounter = 2000;  // 2 seconds timeout

    	//Show SRC limits on displays
        //max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        //max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);


        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "INIT");
        sm->lastState = STATE_INIT;

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================

    // Check if the timeout has elapsed
    if (HAL_GetTick() - sm->stateEntryTime > sm->timeoutCounter) {
		//After initialization transition to IDLE state
		sm->currentState = STATE_IDLE;
		entryDone = false;
    }

}

void handleIdleState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
        // Display set values
        max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);

        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);

        // Check temperature and control fan (not shown in your code)

        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "IDLE");
        sm->lastState = STATE_IDLE;

        entryDone = true;
    }

    //=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================

    // Process events and transitions
    if (sm->outputBtnPressed) {
        sm->currentState = STATE_ACTIVE;
        entryDone = false;
    } else if (sm->lockBtnHoldActive) {
        sm->currentState = STATE_LOCK;
        entryDone = false;
    } else if (sm->ocpBtnPressed) {
        sm->currentState = STATE_OCP_TOGGLE;
        sm->stateEntryTime = HAL_GetTick();
        sm->timeoutCounter = 500;  // 0.5 seconds timeout
        entryDone = false;
    } else if (sm->rotaryBtnPressed) {
        sm->currentState = STATE_SET_VALUES;
        sm->timeoutCounter = 4000;  // 4 seconds timeout
        sm->rotaryBtnPressed = false;
        entryDone = false;
    }
}

void handleActiveState(void) {
	//Declare static variables
	// Set check interval Make the timer persistent across function calls
	//static uint32_t lastCheckTime = 0; // declared to 0 only once, then retains value
    static bool entryDone = false;
	//const uint32_t CHECK_INTERVAL_MS = 500; // Check every 500ms

	//=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================

