MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
    if (!entryDone) {
        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_SET);

        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "ACTIVE");
        sm->lastState = STATE_ACTIVE;

        // Initialize the check timer
        TIM14->ARR = 500;
		LL_TIM_SetCounter(TIM14, 0); //set counter register value of timer 7 to 0
		LL_TIM_EnableIT_UPDATE(TIM14); // Enable update interrupt
		LL_TIM_EnableCounter(TIM14);

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================

    //Periodic check to display measured values
    if (sm->periodicCheckFlag) {
		uint32_t vol = BSP_PWR_VBUSGetVoltage(0)/10; //divide by 10 to get centivolts since only 4 digit display..
		uint32_t cur = BSP_PWR_VBUSGetCurrent(0);

		dhandle ->currentMeas = cur;
		dhandle ->voltageMeas = vol;
		//Display output voltage
		max7219_PrintIspecial(SEGMENT_1, vol, 3);
		//Display output current
		max7219_PrintIspecial(SEGMENT_2, cur, 4);
    }

    //=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================
    if (sm->outputBtnPressed) {
        sm->currentState = STATE_IDLE;
        entryDone = false;
    } else if (sm->lockBtnHoldActive) {
        sm->currentState = STATE_LOCK;
        entryDone = false;
    } else if (sm->awdgTriggeredFlag) {
        sm->currentState = STATE_IDLE;
        entryDone = false;
    } else if (sm->rotaryBtnPressed) {
        sm->currentState = STATE_SET_VALUES;
        sm->timeoutCounter = 4000;  // 4 seconds timeout
        sm->rotaryBtnPressed = false;
        entryDone = false;
    }

    if (sm->outputBtnPressed || sm->ocpBtnPressed) {
    	LL_TIM_DisableCounter(TIM14);
    }
}

void handleSetValuesState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;
    static bool showDigit = false;  // Start with digit shown

    //=======================================================
   	// ENTRY ACTIONS - Executed once when entering the state
   	//=======================================================

    if (!entryDone) {

    	// Display set values
        max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);

        // Initialize the periodic timer
		TIM14->ARR = 500;
		LL_TIM_SetCounter(TIM14, 0); //set counter register value of timer 14 to 0
		LL_TIM_EnableIT_UPDATE(TIM14); // Enable update interrupt
		LL_TIM_EnableCounter(TIM14);

		// Initialize the periodic timer
		LL_TIM_DisableCounter(TIM15);
		TIM15->ARR = sm->timeoutCounter;
		LL_TIM_SetCounter(TIM15, 0); //set counter register value of timer 14 to 0
		LL_TIM_EnableIT_UPDATE(TIM15); // Enable update interrupt
		LL_TIM_EnableCounter(TIM15);

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================

    // User interaction - reset the timeout
	if (sm->rotaryBtnPressed || sm->encoderTurnedFlag || sm->voltageCurrentBtnPressed) {
		// Reset the timeout timer whenever there's user interaction
		LL_TIM_DisableCounter(TIM15);
		LL_TIM_SetCounter(TIM15, 0); //set counter register value of timer 14 to 0
		LL_TIM_EnableIT_UPDATE(TIM15); // Enable update interrupt
		LL_TIM_EnableCounter(TIM15);
	}

	//Process voltageCurrentBtn press
	if (sm->voltageCurrentBtnPressed) {
		//Reset flag
		sm->voltageCurrentBtnPressed = false;
		//Process
		if (sm->setValueMode == SET_VOLTAGE) {
			sm->setValueMode = SET_CURRENT;
		} else if (sm->setValueMode == SET_CURRENT) {
			sm->setValueMode = SET_VOLTAGE;
		}

		//Get values into debug trace
		char _str[60];
		uint32_t voltageADC = BSP_PWR_VBUSGetVoltage(0);
		uint32_t currentADC= BSP_PWR_VBUSGetCurrent(0);
		uint32_t currentOCP_ADC= BSP_PWR_VBUSGetCurrentOCP(0);

		// Use snprintf to limit the number of characters written
		int len = snprintf(_str, sizeof(_str), "VBUS:%lu mV, IBUS:%lu mA, IOCP:%lu mA", voltageADC, currentADC, currentOCP_ADC);

		USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
	}

    //Process encoder press
    if (sm->rotaryBtnPressed) {
		//Decrement encoderPress value if higher than 4
		if (sm->encoder.selDigit > 1){
			sm->encoder.selDigit--;
		}
		else {
			sm->encoder.selDigit = 4;
		}

		//Choose addition value based on setValueMode
		int val;
		switch (sm->setValueMode){
			case SET_VOLTAGE:
				switch (sm->encoder.selDigit) {
				case 1: val = 2; break;
				case 2: val = 10; break;
				case 3: val = 100; break;
				case 4: val = 1000; break;
				}
			 break;
			//case SET_CURRENT:
			case SET_CURRENT:
				switch (sm->encoder.selDigit) {
				case 1: val = 5; break;
				case 2: val = 10; break;
				case 3: val = 100; break;
				case 4: val = 1000; break;
				}
			 break;
		}

		sm->encoder.increment = val;
    }


    //Process encoder turn
    if (sm->encoderTurnedFlag) {
		// Handle encoder pulse event
		int encoderVal = (TIM3 -> CNT) >> 2;

		//
		//Erase FLAG!!
		//
		sm->encoder.curValue= encoderVal;

		if (encoderVal != sm->encoder.prevValue){
			//Get the turn direction and save it
			sm->encoder.direction = (encoderVal < sm->encoder.prevValue) ? 1 : -1;

			//Save TIM3 CNT value to ValPrev
			sm->encoder.prevValue = encoderVal;

			//Set encoder Turn event flag
			sm->encoder.turnEvent = true;
		}
    }

    // Handle digit blinking based on current set mode
    if (sm->periodicCheckFlag) {
    	if (sm->setValueMode == SET_VOLTAGE) {
			max7219_BlinkDigit2(SEGMENT_1, dhandle->voltageSet, sm->encoder.selDigit, 3, showDigit);
			max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet,4);
		} else { // SET_CURRENT
			max7219_BlinkDigit2(SEGMENT_2, dhandle->currentSet, sm->encoder.selDigit, 4, showDigit);
			max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet,3);
		}
    	//Toggle showDigit
    	showDigit = !showDigit;
    }

    // On turnEvent update voltage/current
	if (sm->encoder.turnEvent) {
		//Reset event flag
		sm->encoder.turnEvent = false;
		char _str[40];
		//Update displays
		switch (sm->setValueMode) {
			case SET_VOLTAGE:
				updateVoltage();
				//Print to debug !!calling it from inside updateVoltage() results in hardFault error!!
				sprintf(_str,"VBUS selected: %lu mV", dhandle->voltageSet * 10);
				USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
				break;
			case SET_CURRENT:
				updateCurrent();
				//Print to debug !!calling it from inside updateVoltage() results in hardFault error!!
				sprintf(_str,"IBUS selected: %lu mA", dhandle->currentSet);
				USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
				break;
		}
	}


	//=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================
    // Process events and transitions
	if (sm->lockBtnHoldActive) {
        sm->currentState = STATE_LOCK;
        entryDone = false;
    } else if (sm->ocpBtnPressed) {
        sm->currentState = STATE_OCP_TOGGLE;
        sm->stateEntryTime = HAL_GetTick();
        sm->timeoutCounter = 500;  // 0.5 seconds timeout
        entryDone = false;
    } else if (sm->stateTimeoutFlag) {

