MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
	}
  }
}

/*
void usart2_lupart2_handler(void)
{
    if (LL_LPUART_IsActiveFlag_RXNE_RXFNE(LPUART2) && LL_LPUART_IsEnabledIT_RXNE_RXFNE(LPUART2))
    {
        uint8_t received_char = LL_LPUART_ReceiveData8(LPUART2);
        if (rxIndex < RX_BUFFER_SIZE-1)
        {
            rxBuffer[rxIndex++] = received_char;
            if (rxIndex >= 2 && rxBuffer[rxIndex-2] == '\r' && rxBuffer[rxIndex-1] == '\n')
            {
            	// Check for CRLF ending
				rxBuffer[rxIndex-2] = '\0';  // Null-terminate the string, removing CRLF

				// Print received command for debugging
				LPUART_Transmit(LPUART2, (const uint8_t*)"Received: ", 10);
				LPUART_Transmit(LPUART2, rxBuffer, rxIndex-2);
				LPUART_Transmit(LPUART2, (const uint8_t*)"\r\n", 2);

                processCommand(rxBuffer, rxIndex);
                rxIndex = 0;
            }
        }
    }
}

void LPUART_Transmit(USART_TypeDef *LPUARTx, const uint8_t *pData, uint16_t Size)
{
    for (uint16_t i = 0; i < Size; i++)
    {
        // Wait until TXE flag is set (Transmit data register empty)
        while (!LL_LPUART_IsActiveFlag_TXE(LPUARTx));

        // Transmit 8-bit data
        LL_LPUART_TransmitData8(LPUARTx, pData[i]);
    }

    // Wait until TC flag is set (Transmission complete)
    while (!LL_LPUART_IsActiveFlag_TC(LPUARTx));
}
*/

void processUSBCommand(uint8_t* command, uint32_t length)
{
    if (strncmp((char*)command, "POWERON", length) == 0)
    {
        const char* response = "POWER is ON\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
    else if (strncmp((char*)command, "POWEROFF", length) == 0)
    {
        const char* response = "POWER is OFF\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
    else
    {
        const char* response = "Unknown command\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
}


// Helper function to update voltage
void updateVoltage(void) {
	//Get direction of encoder turning
	int voltageTemp = dhandle->voltageSet;
	voltageTemp += sm->encoder.direction * sm->encoder.increment;

	//If required temp value is within limits, assign it to voltage else assign limits
	if (voltageTemp > dhandle->voltageMax) {
		dhandle->voltageSet = dhandle->voltageMax;

	} else if (voltageTemp < dhandle->voltageMin) {
		dhandle->voltageSet = dhandle->voltageMin;

	} else {
		dhandle->voltageSet = voltageTemp;
	}

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);
}

// Helper function to update voltage and update AWD limit
void updateCurrent(void) {
	//Get direction of encoder turning
	int currentTemp = dhandle->currentSet;
	currentTemp += sm->encoder.direction * sm->encoder.increment;

	//If required temp value is within limits, assign it to voltage else assign limits
	if (currentTemp > dhandle->currentMax) {
		dhandle->currentSet = dhandle->currentMax;

	} else if (currentTemp < dhandle->currentMin) {
		dhandle->currentSet = dhandle->currentMin;

	} else {
		dhandle->currentSet = currentTemp;
	}

	//Update AWD limits
	int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
	int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
	Update_AWD_Thresholds(0, isense_rawADCtrip);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
}

// Helper function to update voltage
void updateCurrentOCP(void) {
	//Get direction of encoder turning
	int currentTemp = dhandle->currentOCPSet;
	currentTemp += sm->encoder.direction * sm->encoder.increment;

	//If required temp value is within limits, assign it to voltage
	if ( (dhandle->currentMin <= currentTemp) && (currentTemp <= (dhandle->currentMax + 300)) ) {
		dhandle->currentOCPSet = currentTemp;
	} else {
		//currentOCPTemp = currentOCP;
	}

	int V_TRIP = (dhandle->currentOCPSet * R_OCP_MOHMS * G_OCP)/1000; // mV (mA * mOhms * Gain)
	//Convert DAC_OUT voltage to 12B resolution
	int dac_value = (V_TRIP *4095) / VDDA_APPLI;//__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B);
	//Write output with DAC..
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentOCPSet, 4);
}
